Autodesk.Revit.DB.SiteInsertServiceData.GetLinkLoadOption
Retreives the TopographyLinkLoadOption to indicate creation options of TopographyLink members
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.SetLinkLoadOption(Autodesk.Revit.DB.Architecture.TopographyLinkLoadOption)
Sets the TopographyLinkLoadOption
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.SetLinkLoadResult(Autodesk.Revit.DB.LinkLoadResult)
Sets the LinkLoadResult
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018